# Напишите программу, которая найдёт произведение пар чисел списка.
# Парой считаем первый и последний элемент, второй и предпоследний и т.д.

# Пример:
# - [2, 3, 4, 5, 6] => [12, 15, 16];
# - [2, 3, 5, 6] => [12, 15]

list = [2, 3, 4, 5, 6, 8, 7]
listRez = []
count = -1

for i in range(len(list)//2):
    n = list[i]* list[count]
    listRez.append(n)
    count -= 1

if len(list)%2 != 0:
    print(f'Произведение пар списка согласно условию: {listRez}')
    print(f'У данного числа пары нет: {list[len(list)//2]}')
    
else:
    print(listRez)